---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ComponentRepeaterSlot
source: html/1c36568e-6332-a011-8f5b-c5aa3e58b446.htm
---
# ComponentRepeaterSlot Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.